asciiart-load-test.yml
config:
  payload:
    path: 'artileryData.csv'
    order: sequence
    fields:
      - 'email'
      - 'password'
      - 'firstName'
      - 'lastName'
      - 'token'
      - 'pin'
      - 'amount'

  target: http://localhost:3000/api
  phases:
    - duration: 60
      arrivalCount: 5
      name: high_load_test

  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 500
scenarios:
  - flow:
      - loop:
          - get:
              url: '/donation/all?from=2024-09-11&to=2024-09-14&page=1&limit=5'
              headers:
                authorization: 'Bearer {{ token }}'
          - get:
              url: '/donation/3'
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYyMjMyOTIsImV4cCI6MTcyNjMwOTY5Mn0.KwrYiF9PBkjxx_Axsza6gUGXuoIjKbwCWpNuOiW5q2k'
          - post:
              url: '/auth/login'
              json:
                email: 'funmistar@yahoo.com'
                password: 'helloworld'
          - post:
              url: '/wallet/fund'
              json:
                pin: '2144'
                amount: 10000
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYyMjMyOTIsImV4cCI6MTcyNjMwOTY5Mn0.KwrYiF9PBkjxx_Axsza6gUGXuoIjKbwCWpNuOiW5q2k'

          - get:
              url: 'api/wallet'
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYyMjMyOTIsImV4cCI6MTcyNjMwOTY5Mn0.KwrYiF9PBkjxx_Axsza6gUGXuoIjKbwCWpNuOiW5q2k'

          - get:
              url: '/api/donation?page=1&limit=5'
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYyMjMyOTIsImV4cCI6MTcyNjMwOTY5Mn0.KwrYiF9PBkjxx_Axsza6gUGXuoIjKbwCWpNuOiW5q2k'

          - post:
              url: '/api/donation'
              json:
                toWalletId: 2
                amount: 100
                pin: '2144'
                note: 'note'
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYyMjMyOTIsImV4cCI6MTcyNjMwOTY5Mn0.KwrYiF9PBkjxx_Axsza6gUGXuoIjKbwCWpNuOiW5q2k'
        count: 1