asciiart-load-test.yml
config:
  payload:
    path: 'artileryData.csv'
    order: sequence
    fields:
      - 'email'
      - 'password'
      - 'firstName'
      - 'lastName'
      - 'token'
      - 'pin'
      - 'amount'

  target: http://localhost:3000/api
  phases:
    - duration: 90
      arrivalCount: 10
      name: high_load_test

  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 200
      # - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: '/donation/all?from=2024-09-11&to=2024-09-13&page=1&limit=5'
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYxNzQxMzUsImV4cCI6MTcyNjI2MDUzNX0.xN-nofTAQGxQrb-2ELZJf0pCL0kSGuswaVlADOt-Ni8'
          # - get:
          #     url: '/donation/3'
          #     headers:p
          #       authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYxNzQxMzUsImV4cCI6MTcyNjI2MDUzNX0.xN-nofTAQGxQrb-2ELZJf0pCL0kSGuswaVlADOt-Ni8'
          - post:
              url: '/auth/login'
              json:
                email: 'funmistar@yahoo.com'
                password: 'helloworld'
          - post:
              url: '/wallet/fund'
              json:
                pin: '2144'
                amount: 10000
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYxNzQxMzUsImV4cCI6MTcyNjI2MDUzNX0.xN-nofTAQGxQrb-2ELZJf0pCL0kSGuswaVlADOt-Ni8'

          - get:
              url: 'api/wallet'
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYxNzQxMzUsImV4cCI6MTcyNjI2MDUzNX0.xN-nofTAQGxQrb-2ELZJf0pCL0kSGuswaVlADOt-Ni8'

          - get:
              url: '/api/donation?page=1&limit=5'
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYxNzQxMzUsImV4cCI6MTcyNjI2MDUzNX0.xN-nofTAQGxQrb-2ELZJf0pCL0kSGuswaVlADOt-Ni8'

          - post:
              url: '/api/donation'
              json:
                toWalletId: 2
                amount: 100
                pin: '2144'
                note: 'note'
              headers:
                authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImZ1bm1pc3RhckB5YWhvby5jb20iLCJpYXQiOjE3MjYxNzQxMzUsImV4cCI6MTcyNjI2MDUzNX0.xN-nofTAQGxQrb-2ELZJf0pCL0kSGuswaVlADOt-Ni8'
        count: 1